src/Catalogs/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Долги</name>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляУчетаВзятыхДолгов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляУчетаВыданныхДолгов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПараметрыГрафикаПогашенияДолгов/ПараметрыГрафикаПогашенияДолгов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыГрафикаПогашенияДолгов</name>
  <resources>
    <name>ДатаВозникновенияДолга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕдиноразовойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕжемесячнойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПогашения</name>
    <type>
      <types>EnumRef.СпособыПогашенияКредита</types>
    </type>
  </resources>
  <resources>
    <name>СрокМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейВГоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньМесяцаДляРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияДолга</name>
    <comment>С этой даты отменяются все плановые операции</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПересчитыватьПриРедактировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонОперации</name>
    <type>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </resources>
  <resources>
    <name>КошелекДляПогашения</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </resources>
  <resources>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДляУчетаПроцентов</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕдиноразовойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕжемесячнойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Долги/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


Функция ПолучитьШаблонДляПогашенияДолга(Долг) Экспорт

	ЗаписьРегистра = РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Долг = Долг;
	ЗаписьРегистра.Прочитать();
	Возврат ЗаписьРегистра.ШаблонОперации;

КонецФункции

#КонецОбласти



#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	ОбслуживаниеСправочников.ПроверитьСтандартныеПараметрыОтбора(Параметры);
	
	// Если в параметрах есть необходимые ключи/значения будет выполнена расширенная обработка получения данных
	ОбслуживаниеСправочников.ВыполнитьРасширенноеПолучениеДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если НЕ Параметры.Свойство("Ключ") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Обработка.ПомощникСозданияДолга.Форма";
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда 
		
		ОбслуживаниеСправочников.ОбработкаПолученияФормыВыбора(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
